spec/dummy/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Title After"], ["updated_at", "2014-07-30 09:11:15.289271"]]
---
  def update
    post = @current_user.posts.find(params[:id])
    post.title = 'Title After'
    post.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_current_user
    @current_user = User.find(params[:user_id])